nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/ecat_examples/digital_io/cm7/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Port1_RMII_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Port1_MII_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_ECAT_RX_DATA0_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_ECAT_RX_DATA1_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_ECAT_RX_DATA2_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_ECAT_RX_DATA3_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_ECAT_RX_ER_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_ECAT_RX_DV_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_38_ECAT_RX_CLK_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_27_ECAT_TX_DATA0_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_26_ECAT_TX_DATA1_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_ECAT_TX_DATA2_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_ECAT_TX_DATA3_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_ECAT_TX_EN_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_ECAT_TX_CLK_1, 1);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 is configured as ECAT_LINK_1 */
      0U); 
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_ECAT_I2C_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: K16, peripheral: ECAT, signal: SCL, pin_signal: GPIO_AD_18, pull_up_down_config: Pull_Up, open_drain: Enable, slew_rate: Slow}
  - {pin_num: L13, peripheral: ECAT, signal: SDA, pin_signal: GPIO_AD_19, pull_up_down_config: Pull_Up, open_drain: Enable, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_ECAT_I2C_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_ECAT_I2C_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_18_ECAT_PROM_CLK,        /* GPIO_AD_18 is configured as ECAT_PROM_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_19_ECAT_PROM_DATA,       /* GPIO_AD_19 is configured as ECAT_PROM_DATA */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_18_ECAT_PROM_CLK,        /* GPIO_AD_18 PAD functional properties : */
      0x1EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Enabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_19_ECAT_PROM_DATA,       /* GPIO_AD_19 PAD functional properties : */
      0x1EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Enabled
                                                 Force ibe off Field: Disabled */
}

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_ECAT_MDIO_InitPins();
    BOARD_Port0_MII_InitPins();
    BOARD_Port1_MII_InitPins();
    BOARD_ECAT_I2C_InitPins();
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/